//================================================================================
//
//  AppleSystemInfo.strings
//  AppleSystemInfo
//
//  Created by Steve Ko on Mon Apr 07 2003.
//  Copyright (c) 2003 Apple Computer. All rights reserved.
//
//--------------------------------------------------------------------------------

//================================================================================
//
//  The strings in this section are used to format the processor (a.k.a. CPU)
//  descriptions.
//
//--------------------------------------------------------------------------------

//================================================================================
//  String used to format a processor speed string when the processor speed is
//  less than 1 GHz.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%d".
//  "%d" will get replaced by the actual speed in units of MHz (e.g. "800").
//--------------------------------------------------------------------------------
"MHzFormat"		= "%d MHz";

//================================================================================
//  String used to format a processor speed string when the processor speed is
//  greater than or equal to 1 GHz.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%.*f".
//  "%.*f" will get replaced by the actual speed in units of GHz (e.g. "1.25").
//--------------------------------------------------------------------------------
"GHzFormat"		= "%.*f GHz";

//================================================================================
//  String used to combine the processor speed and type into a single string.
//
//  IMPORTANT: Make sure the right hand side value contains the substrings "%1$@"
//  and "%2$@".  "%1$@" will get replaced by the processor speed string
//  (e.g. "800 MHz"), and "%2$@" will get replaced by the processor type string
//  (e.g. "PowerPC G3").
//--------------------------------------------------------------------------------
"SpeedAndTypeFormat"	= "%1$@ %2$@";

//================================================================================
//  String used to describe a dual processor configuration.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%@".
//  "%@" will get replaced by the processor speed and type string
//  (e.g. "800 MHz PowerPC G3").
//--------------------------------------------------------------------------------
"2xCPUFormat"		= "デュアル %@";

//================================================================================
//  String used to describe a triple processor configuration.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%@".
//  "%@" will get replaced by the processor speed and type string
//  (e.g. "800 MHz PowerPC G3").
//--------------------------------------------------------------------------------
"3xCPUFormat"		= "3 x %@";

//================================================================================
//  String used to describe a quadruple processor configuration.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%@".
//  "%@" will get replaced by the processor speed and type string
//  (e.g. "800 MHz PowerPC G3").
//--------------------------------------------------------------------------------
"4xCPUFormat"		= "4 x %@";

//================================================================================
//  String used to describe a N processor configuration where N > 2.
//
//  IMPORTANT: Make sure the right hand side value contains the substrings "%1$d"
//  and "%2$@".  "%1$d" will get replaced by the number of processors (e.g. "4"),
//  and "%2$@" will get replaced by the processor speed and type string
//  (e.g. "800 MHz PowerPC G3").
//--------------------------------------------------------------------------------
"NxCPUFormat"		= "%1$d × %2$@";

//================================================================================
//  String used to describe a unknown processor kind.
//--------------------------------------------------------------------------------
"UnknownCPUKind"	= "不明";

//================================================================================
//  String used to describe a unknown computer model.
//--------------------------------------------------------------------------------
"UnknownComputerModel"	=	"不明";

//================================================================================
//
//  The strings in this section are used to format the RAM descriptions.
//
//--------------------------------------------------------------------------------

//================================================================================
//  String used to format RAM or disk size description, when there is less than 1 GB.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%d".
//  "%d" will get replaced by the actual size in units of MB (e.g. "256").
//--------------------------------------------------------------------------------
"DecimalMB"		= "%d MB";
"BinaryMB"		= "%d MiB";

//================================================================================
//  String used to format RAM  or disk size description, when there is more than 1 GB.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%.*f".
//  "%.*f" will get replaced by the actual size in units of GB (e.g. "1.2").
//--------------------------------------------------------------------------------
"DecimalGB"		= "%.*f GB";
"BinaryGB"		= "%.*f GiB";

//================================================================================
//  String used to format RAM or disk size description, when there is more than 1 TB.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%.*f".
//  "%.*f" will get replaced by the actual size in units of TB (e.g. "1.2").
//--------------------------------------------------------------------------------
"DecimalTB"		= "%.*f TB";
"BinaryTB"		= "%.*f TiB";

//================================================================================
//  String used to format RAM or disk size description, when there is more than 1 PB.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%.*f".
//  "%.*f" will get replaced by the actual size in units of PB (e.g. "1.2").
//--------------------------------------------------------------------------------
"DecimalPB"		= "%.*f PB";
"BinaryPB"		= "%.*f PiB";

//================================================================================
//  String used to format RAM or disk size description, when there is more than 1 EB.
//
//  IMPORTANT: Make sure the right hand side value contains the substring "%.*f".
//  "%.*f" will get replaced by the actual size in units of EB (e.g. "1.2").
//--------------------------------------------------------------------------------
"DecimalEB"		= "%.*f EB";
"BinaryEB"		= "%.*f EiB";


//================================================================================
// Model names
//--------------------------------------------------------------------------------
/* default name */
"Mac" = "Mac";

/* xserve */
"Xserve" = "Xserve";
"XserveG5" = "Xserve G5";

/* mini */
"Macmini" = "Mac mini";

/* eMac */
"eMac" = "eMac";

/* iMac */
"iMac" = "iMac";
"iMacG5" = "iMac G5";

/* PowerMac */
"PowerMacG3" = "Power Macintosh G3";
"PowerMacG3Series" = "Power Macintosh G3 シリーズ";
"PowerMacG3PCI" = "Power Mac G3（PCI グラフィックス）";
"PowerMacG4AGP" = "Power Mac G4（AGP グラフィックス）";
"PowerMacG4" = "Power Mac G4";
"PowerMacG4Cube" = "Power Mac G4 Cube";
"PowerMacG5" = "Power Mac G5";

/* iBook */
"iBook" = "iBook";
"iBookG4" = "iBook G4";

/* PowerBook */
"PowerBookG3Series" = "PowerBook G3 シリーズ";
"PowerBook" = "PowerBook";
"PowerBookG4" = "PowerBook G4";
"PowerBookG415" = "PowerBook G4 15\"";
"PowerBookG417" = "PowerBook G4 17\"";
"PowerBookG412" = "PowerBook G4 12\"";

/* MacBook */
"MacBook" = "MacBook";

/* MacBook Air*/
"MacBookAir" = "MacBook Air";

/* MacBook Pro */
"MacBookPro15" = "MacBook Pro 15\"";
"MacBookPro17" = "MacBook Pro 17\"";
"MacBookPro" = "MacBook Pro";

/* Mac Pro */
"MacPro" = "Mac Pro";

